# IFCParameter Template Is Property Set AMember Of Template Method

Source: https://www.revitapidocs.com/2026/1d036e8a-64f8-dff2-7d49-789287137f14.htm

---

| IFCParameter Template Is Property Set AMember Of Template Method |
| --- |

Checks whether a property set exists in the template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsPropertySetAMemberOfTemplate(
	PropertySetupType propertySetupType,
	string propertySetName
)
```

```
Public Function IsPropertySetAMemberOfTemplate (
	propertySetupType As PropertySetupType,
	propertySetName As String
) As Boolean
```

```
public:
bool IsPropertySetAMemberOfTemplate(
	PropertySetupType propertySetupType,
	String^ propertySetName
)
```

```
member IsPropertySetAMemberOfTemplate :
        propertySetupType : PropertySetupType *
        propertySetName : string -> bool
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

#### Return Value

Boolean
True if the property set exists in the template. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace